<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"b44ba0bc73cfa464592bc282aac09daf56ee877751fca8a07b2ea46d81f00837","plan_job_ref":"Job Create Terraform plan (DEV) #30 at https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14832808756","plan_out_hash":"4abe94cd94aeca6c8ca538432ed96ad75128c0685b25f029016582967fb5a9e9","plan_hash":"b10e0aed01cd72cd121999bdaddb698d3b1843bf0259370338b17a5d98fc3896","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
With var files: `terraform/dev/dev.tfvars`
<details>
<summary>Plan: 9 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.container_app.azurerm_container_app.backend[0] will be created
+   resource "azurerm_container_app" "backend" {
+       container_app_environment_id  = (known after apply)
+       custom_domain_verification_id = (sensitive value)
+       id                            = (known after apply)
+       latest_revision_fqdn          = (known after apply)
+       latest_revision_name          = (known after apply)
+       location                      = (known after apply)
+       name                          = "openrmscore-dev-app-backend"
+       outbound_ip_addresses         = (known after apply)
+       resource_group_name           = "rg-openrmscore-dev"
+       revision_mode                 = "Single"
+       tags                          = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
+       workload_profile_name         = "Consumption"

+       identity {
+           identity_ids = [
+               "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openrmscore-dev-uai",
            ]
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "UserAssigned"
        }

+       ingress {
+           allow_insecure_connections = true
+           custom_domain              = (known after apply)
+           external_enabled           = false
+           fqdn                       = (known after apply)
+           target_port                = 8080
+           transport                  = "http"

+           traffic_weight {
+               latest_revision = true
+               percentage      = 100
            }
        }

+       registry {
+           identity = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openrmscore-dev-uai"
+           server   = "openrmscoredevacr.azurecr.io"
        }

+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

+       template {
+           max_replicas                     = 5
+           min_replicas                     = 1
+           revision_suffix                  = (known after apply)
+           termination_grace_period_seconds = 0

+           container {
+               cpu               = 1
+               ephemeral_storage = (known after apply)
+               image             = "openrmscoredevacr.azurecr.io/openrmscore-backend:latest"
+               memory            = "2Gi"
+               name              = "backend"

+               env {
+                   name        = "OMRS_CONFIG_AUTO_UPDATE_DATABASE"
+                   secret_name = "omrs-config-auto-update-database"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_DATABASE"
+                   secret_name = "omrs-config-connection-database"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_PASSWORD"
+                   secret_name = "omrs-config-connection-password"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_SERVER"
+                   secret_name = "omrs-config-connection-server"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_USERNAME"
+                   secret_name = "omrs-config-connection-username"
                }
+               env {
+                   name        = "OMRS_CONFIG_CREATE_TABLES"
+                   secret_name = "omrs-config-create-tables"
                }
+               env {
+                   name        = "OMRS_CONFIG_MODULE_WEB_ADMIN"
+                   secret_name = "omrs-config-module-web-admin"
                }

+               volume_mounts {
+                   name = "openmrs-data"
+                   path = "/openmrs/data"
                }
            }

+           volume {
+               name         = "openmrs-data"
+               storage_name = "openrms-storage"
+               storage_type = "AzureFile"
            }
        }
    }

  # module.container_app.azurerm_container_app.frontend[0] will be created
+   resource "azurerm_container_app" "frontend" {
+       container_app_environment_id  = (known after apply)
+       custom_domain_verification_id = (sensitive value)
+       id                            = (known after apply)
+       latest_revision_fqdn          = (known after apply)
+       latest_revision_name          = (known after apply)
+       location                      = (known after apply)
+       name                          = "openrmscore-dev-app-frontend"
+       outbound_ip_addresses         = (known after apply)
+       resource_group_name           = "rg-openrmscore-dev"
+       revision_mode                 = "Single"
+       tags                          = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
+       workload_profile_name         = "Consumption"

+       identity {
+           identity_ids = [
+               "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openrmscore-dev-uai",
            ]
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "UserAssigned"
        }

+       ingress {
+           allow_insecure_connections = true
+           custom_domain              = (known after apply)
+           external_enabled           = false
+           fqdn                       = (known after apply)
+           target_port                = 80
+           transport                  = "http"

+           traffic_weight {
+               latest_revision = true
+               percentage      = 100
            }
        }

+       registry {
+           identity = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openrmscore-dev-uai"
+           server   = "openrmscoredevacr.azurecr.io"
        }

+       template {
+           max_replicas                     = 5
+           min_replicas                     = 1
+           revision_suffix                  = (known after apply)
+           termination_grace_period_seconds = 0

+           container {
+               cpu               = 1
+               ephemeral_storage = (known after apply)
+               image             = "openrmscoredevacr.azurecr.io/openrmscore-frontend:latest"
+               memory            = "2Gi"
+               name              = "frontend"

+               env {
+                   name  = "API_URL"
+                   value = "/openmrs"
                }
+               env {
+                   name  = "SPA_CONFIG_URLS"
+                   value = "/openmrs/spa/config-core_demo.json"
                }
+               env {
+                   name  = "SPA_DEFAULT_LOCALE"
#                    (1 unchanged attribute hidden)
                }
+               env {
+                   name  = "SPA_PATH"
+                   value = "/openmrs/spa"
                }
            }
        }
    }

  # module.container_app.azurerm_container_app.gateway[0] will be created
+   resource "azurerm_container_app" "gateway" {
+       container_app_environment_id  = (known after apply)
+       custom_domain_verification_id = (sensitive value)
+       id                            = (known after apply)
+       latest_revision_fqdn          = (known after apply)
+       latest_revision_name          = (known after apply)
+       location                      = (known after apply)
+       name                          = "openrmscore-dev-app-gateway"
+       outbound_ip_addresses         = (known after apply)
+       resource_group_name           = "rg-openrmscore-dev"
+       revision_mode                 = "Single"
+       tags                          = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
+       workload_profile_name         = "Consumption"

+       identity {
+           identity_ids = [
+               "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openrmscore-dev-uai",
            ]
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "UserAssigned"
        }

+       ingress {
+           allow_insecure_connections = true
+           custom_domain              = (known after apply)
+           external_enabled           = true
+           fqdn                       = (known after apply)
+           target_port                = 80
+           transport                  = "http"

+           traffic_weight {
+               latest_revision = true
+               percentage      = 100
            }
        }

+       registry {
+           identity = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openrmscore-dev-uai"
+           server   = "openrmscoredevacr.azurecr.io"
        }

+       template {
+           max_replicas                     = 5
+           min_replicas                     = 1
+           revision_suffix                  = (known after apply)
+           termination_grace_period_seconds = 0

+           container {
+               cpu               = 1
+               ephemeral_storage = (known after apply)
+               image             = "openrmscoredevacr.azurecr.io/openrmscore-gateway:latest"
+               memory            = "2Gi"
+               name              = "gateway"
            }
        }
    }

  # module.container_app.azurerm_container_app_environment.this will be created
+   resource "azurerm_container_app_environment" "this" {
+       custom_domain_verification_id    = (known after apply)
+       default_domain                   = (known after apply)
+       docker_bridge_cidr               = (known after apply)
+       id                               = (known after apply)
+       infrastructure_subnet_id         = "**********************************************************************************************************************************************************************************"
+       internal_load_balancer_enabled   = false
+       location                         = "francecentral"
+       log_analytics_workspace_id       = "***********************************************************************************************************************************************************"
+       logs_destination                 = "log-analytics"
+       mutual_tls_enabled               = false
+       name                             = "openrmscore-dev-env"
+       platform_reserved_cidr           = (known after apply)
+       platform_reserved_dns_ip_address = (known after apply)
+       resource_group_name              = "rg-openrmscore-dev"
+       static_ip_address                = (known after apply)
+       tags                             = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
+       zone_redundancy_enabled          = false

+       workload_profile {
+           maximum_count         = 3
+           minimum_count         = 1
+           name                  = "Consumption"
+           workload_profile_type = "Consumption"
        }
    }

  # module.container_app.azurerm_container_app_environment_storage.this will be created
+   resource "azurerm_container_app_environment_storage" "this" {
+       access_key                   = (sensitive value)
+       access_mode                  = "ReadWrite"
+       account_name                 = "openrmscoredevstorage"
+       container_app_environment_id = (known after apply)
+       id                           = (known after apply)
+       name                         = "openrms-storage"
+       share_name                   = "openmrs-data"
    }

  # module.keyvault.azurerm_role_assignment.data_plane["kv-secrets-officer"] must be replaced
-/+ resource "azurerm_role_assignment" "data_plane" {
+       condition_version                      = (known after apply)
!~      id                                     = "***********************************************************************************************************************************************************************************************************************************" -> (known after apply)
!~      name                                   = "34d93cde-348b-2c51-b4f7-e05c2f9150e5" -> (known after apply)
!~      principal_id                           = "7039aa21-edae-48d2-932b-51c35303ff75" -> "14bba8fe-c8f5-47cf-92bb-1dcd6911f4b3" # forces replacement
!~      principal_type                         = "User" -> (known after apply)
!~      role_definition_id                     = "******************************************************************************************************************************************" -> (known after apply)
+       skip_service_principal_aad_check       = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.network.azurerm_network_security_group.this["appgw"] will be created
+   resource "azurerm_network_security_group" "this" {
+       id                  = (known after apply)
+       location            = "francecentral"
+       name                = "openrmscore-dev-nsg-appgw"
+       resource_group_name = "rg-openrmscore-dev"
+       security_rule       = [
+           {
+               access                                     = "Allow"
+               destination_address_prefix                 = "*"
+               destination_address_prefixes               = []
+               destination_application_security_group_ids = []
+               destination_port_range                     = "*"
+               destination_port_ranges                    = []
+               direction                                  = "Inbound"
+               name                                       = "AllowAllInbound"
+               priority                                   = 100
+               protocol                                   = "*"
+               source_address_prefix                      = "*"
+               source_address_prefixes                    = []
+               source_application_security_group_ids      = []
+               source_port_range                          = "*"
+               source_port_ranges                         = []
#                (1 unchanged attribute hidden)
            },
        ]
+       tags                = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
    }

  # module.network.azurerm_subnet.this["aca"] will be updated in-place
!~  resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-aca"
        name                                          = "openrmscore-dev-aca"
#        (8 unchanged attributes hidden)

!~      delegation {
            name = "delegation-aca"

!~          service_delegation {
!~              actions = [
-                   "Microsoft.Network/virtualNetworks/subnets/join/action",
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
                name    = "Microsoft.App/environments"
            }
        }
    }

  # module.network.azurerm_subnet.this["appgw"] will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                              = [
+           "10.10.2.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "openrmscore-dev-appgw"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-openrmscore-dev"
+       virtual_network_name                          = "openrmscore-dev-vnet"
    }

  # module.network.azurerm_subnet_network_security_group_association.this["appgw"] will be created
+   resource "azurerm_subnet_network_security_group_association" "this" {
+       id                        = (known after apply)
+       network_security_group_id = (known after apply)
+       subnet_id                 = (known after apply)
    }

Plan: 9 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #30](https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14832808756)